base/Catalogs/бит_СпособыКомпоновкиИсточниковДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СпособыКомпоновкиИсточниковДанных</Name>
			<Comment>Способы компоновки источников данных</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.бит_ИсточникиДанных</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Наименование полное</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеМногоязычное</Name>
					<Comment>Наименование многоязычное</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Comment>Схема компоновки данных</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРассчитыватьИтогиПоГруппам</Name>
					<Comment>Не рассчитывать итоги по группам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КолонкиТаблицы</Name>
					<Comment>Колонки таблицы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКолонки</Name>
							<Comment>Имя колонки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКолонки</Name>
							<Comment>Вид колонки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьВРасчетах</Name>
							<Comment>Использовать в расчетах</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеТипов</Name>
							<Comment>Описание типов</Comment>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПересчетаПоКурсам</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыПересчетаПоКурсам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсточникиДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Comment>Источник данных</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СпособыКомпоновкиИсточниковДанных</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоответствиеКолонок</Name>
					<Comment>Соответствие колонок</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Comment>Источник данных</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СпособыКомпоновкиИсточниковДанных</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКолонкиИсточника</Name>
							<Comment>Имя колонки источника</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКолонки</Name>
							<Comment>Имя колонки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Enums/бит_ВидыГруппДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыГруппДанных</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыборкаДанных</Name>
					<Comment>Выборка данных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Группировка</Name>
					<Comment>Группировка</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Формула</Name>
					<Comment>Формула</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
					<Comment>Текст</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_СпособыКомпоновкиИсточниковДанных/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

//Экспортные процедуры и функции, вызываемые другими объектами и программами

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("Основание") И ТипЗнч(ДанныеЗаполнения.Основание) = Тип("СправочникСсылка.бит_ИсточникиДанных") Тогда
			ЗаполнитьПоИсточникуДанных(ДанныеЗаполнения.Основание);
		КонецЕсли; 
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.бит_ИсточникиДанных") Тогда
		ЗаполнитьПоИсточникуДанных(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
 
// Функция получает элементы данных способа компоновки источников данных.
// 
// Параметры:
//  СпособКомпоновки - СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных.
// 
// Возвращаемое значение:
//  РезультатЗапроса
// 
Функция ПолучитьЭлементыДанных(СпособКомпоновки) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", СпособКомпоновки);
	Запрос.Текст = 
	"
	|ВЫБРАТЬ
	|	бит_ЭлементыДанных.Ссылка КАК Ссылка,
	|	бит_ЭлементыДанных.ВидГруппы,
	|	ЗНАЧЕНИЕ(Справочник.бит_ЭлементыДанных.ПустаяСсылка) КАК Приемник
	|ИЗ
	|	Справочник.бит_ЭлементыДанных КАК бит_ЭлементыДанных
	|ГДЕ
	|	бит_ЭлементыДанных.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка ИЕРАРХИЯ
	|";
	
    Результат = Запрос.Выполнить();
	
	Возврат Результат;

КонецФункции // ПолучитьЭлементыДанных()

// Процедура выполняет копирование элементов данных.
// 
// Параметры:
//  РезультатЭлементыДанных  	- РезультатЗапроса.
//  НовыйВладелец            	- СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных.
//  СоответствиеЭлементовДанных - Соответствие (По умолчанию = Неопределено).
// 
Процедура СкопироватьЭлементыДанных(РезультатЭлементыДанных, НовыйВладелец, СоответствиеЭлементовДанных = Неопределено) Экспорт

	СоответствиеЭлементовДанных = Новый Соответствие;
	
	ДеревоДанные = РезультатЭлементыДанных.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	НачатьТранзакцию();
	
	ОбойтиИерархиюЭлементовДанных(ДеревоДанные, НовыйВладелец, СоответствиеЭлементовДанных);
	
	// Замена аргументов в формулах
	СтрОтбор = Новый Структура;
	СтрОтбор.Вставить("ВидГруппы", Перечисления.бит_ВидыГруппДанных.Формула);
	
	МассивСтрокФормул = ДеревоДанные.Строки.НайтиСтроки(СтрОтбор, Истина);
	
	Для каждого СтрокаФормула Из МассивСтрокФормул Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаФормула.Приемник) Тогда		
			Продолжить;		
		КонецЕсли; 
		
		СпрОбъект = СтрокаФормула.Приемник.ПолучитьОбъект();
		Для каждого СтрокаТаблицы Из СпрОбъект.СтрокиРасчетаДляФормулы Цикл
		
			КодСтарый 	  = СтрокаТаблицы.СтрокаРасчета.Код;
			КодНовый  	  = "";
			НовыйАргумент = Справочники.бит_ЭлементыДанных.ПустаяСсылка();
			
			СтрокаДереваАргумент = ДеревоДанные.Строки.Найти(СтрокаТаблицы.СтрокаРасчета, "Ссылка", Истина);
			Если Не СтрокаДереваАргумент = Неопределено Тогда
			
				НовыйАргумент = СтрокаДереваАргумент.Приемник;
				КодНовый      = НовыйАргумент.Код;
			
			КонецЕсли; 
			
			СтрокаТаблицы.СтрокаРасчета = НовыйАргумент;
			КодНовый                    = КодНовый;
			
			// Замена кодов в тексте формулы
			СпрОбъект.Формула = СтрЗаменить(СпрОбъект.Формула, КодСтарый, КодНовый);
		
		КонецЦикла; // По аргументам
		
		бит_ОбщегоНазначения.ЗаписатьСправочник(СпрОбъект, , "Ошибки");
		
	КонецЦикла; // По строкам дерева с элементами данных - формулами.
	
	ЗафиксироватьТранзакцию();  	                            
								
	ТекстСообщения = НСтр("ru='Копирование завершено.';en='Copying completed.'");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
КонецПроцедуры // СкопироватьЭлементыДанных()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет обход элементов данных и копирует элементы данных.
// Рекурсивный вызов.
// 
// Параметры:
//  СтрокаВерх  				- СтрокаДереваЗначений.
//  НовыйВладелец 				- СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных.
//  СоответствиеЭлементовДанных - Соответсвие.
// 
Процедура ОбойтиИерархиюЭлементовДанных(СтрокаВерх, НовыйВладелец, СоответствиеЭлементовДанных)
	
	Для каждого СтрокаДерева Из СтрокаВерх.Строки Цикл

		СпрОбъект = СтрокаДерева.Ссылка.Скопировать();
		СпрОбъект.Владелец = НовыйВладелец;
		
		Если ЗначениеЗаполнено(СпрОбъект.Родитель) Тогда
			// Замена родителя
			СпрОбъект.Родитель = СтрокаВерх.Приемник; 
		КонецЕсли; 

		ДействиеВыполнено = бит_ОбщегоНазначения.ЗаписатьСправочник(СпрОбъект, , "Все");
		Если ДействиеВыполнено Тогда 
			СтрокаДерева.Приемник = СпрОбъект.Ссылка;
			СоответствиеЭлементовДанных.Вставить(СтрокаДерева.Ссылка, СтрокаДерева.Приемник);  
		КонецЕсли; 

		ОбойтиИерархиюЭлементовДанных(СтрокаДерева, НовыйВладелец, СоответствиеЭлементовДанных);

	КонецЦикла; 
	
КонецПроцедуры // ОбойтиИерархиюЭлементовДанных()

Процедура ЗаполнитьПоИсточникуДанных(ДанныеЗаполнения)

	Если ПустаяСтрока(Наименование) Тогда
		Наименование = Строка(ДанныеЗаполнения);
	КонецЕсли; 
	
	НоваяСтрока = ИсточникиДанных.Добавить();
	НоваяСтрока.ИсточникДанных = ДанныеЗаполнения;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоляИсточника.НомерСтроки КАК НомерСтроки,
	|	ПоляИсточника.Имя,
	|	ПоляИсточника.Синоним,
	|	ПоляИсточника.ВидПоля
	|ИЗ
	|	Справочник.бит_ИсточникиДанных.Поля КАК ПоляИсточника
	|ГДЕ
	|	ПоляИсточника.Ссылка = &Ссылка
	|	И ПоляИсточника.Использование
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка 		 = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = КолонкиТаблицы.Добавить();
		НоваяСтрока.ИмяКолонки = Выборка.Имя;
		НоваяСтрока.ВидКолонки = Выборка.ВидПоля;
		
		НоваяСтрока = СоответствиеКолонок.Добавить();
		НоваяСтрока.ИмяКолонки 			= Выборка.Имя;
		НоваяСтрока.ИмяКолонкиИсточника = Выборка.Имя;
		НоваяСтрока.ИсточникДанных      = ДанныеЗаполнения;
		
	КонецЦикла;
	
КонецПроцедуры
 
#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
